{
  "last_updated": "2025-12-27 12:39:14",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251226045338.htm",
      "status": "published",
      "reason": null,
      "original_headline": "Something fundamental about black holes may be changing",
      "original_summary": "New observations reveal that the relationship between ultraviolet and X-ray light in quasars has changed over billions of years. This unexpected shift suggests the structure around supermassive black holes may evolve with time, challenging a decades-old assumption.",
      "fantasy_headline": "Ancient Void Maws Might Be Changing Their Shape!",
      "fantasy_story": "Master Astrologers observing distant star-lanterns have noticed the unseen glimmers shifting over eons. This strange discovery suggests that even the Great Void Maws might evolve, challenging ancient lore about their unchanging nature. It is a mystery for the ages.",
      "tag": "magic"
    },
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251225085728.htm",
      "status": "published",
      "reason": null,
      "original_headline": "A Christmas tree 80 light-years wide appears in space",
      "original_summary": "This Christmas, astronomers are highlighting a spectacular region of space that looks remarkably like a glowing holiday tree. Known as NGC 2264, this distant star-forming region sits about 2,700 light-years away and is filled with newborn stars lighting up clouds of gas and dust. The stars form a tr",
      "fantasy_headline": "Celestial Sages Discover Giant Star-Tree in the Sky Expanse!",
      "fantasy_story": "Just in time for the Winter Solstice, the Celestial Sages have unveiled a wonder! Far in the Great Sky Expanse, a vast region of newborn sky-gems and shimmering mist appears like a colossal, glowing celebration tree. It is truly a magnificent sight.",
      "tag": "nature"
    },
    {
      "id": "https://www.theverge.com/news/850398/rodeo-hinge-social-app-friends",
      "status": "published",
      "reason": null,
      "original_headline": "Rodeo is an app for making plans with friends you already have",
      "original_summary": "There are plenty of dating apps out there and apps that turn your chaos of work obligations into easily actionable lists. There is also a growing number of apps that help you make new friends. The pitch for Rodeo is a bit different in that it uses AI to help you schedule activities with your […]",
      "fantasy_headline": "New Enchanted Scroll Helps Friends Plan Gatherings!",
      "fantasy_story": "A clever new enchanted scroll has emerged from the Scribe's Guild! Unlike other scrolls that find new companions or organize tasks, this one employs a small Clever Spirit. It helps you perfectly orchestrate feasts and adventures with the companions you already hold dear.",
      "tag": "magic"
    }
  ]
}