{
  "last_updated": "2025-12-30 08:29:18",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251228074505.htm",
      "status": "published",
      "reason": null,
      "original_headline": "The deep ocean has a missing link and scientists finally found it",
      "original_summary": "Scientists have uncovered why big predators like sharks spend so much time in the ocean’s twilight zone. The answer lies with mid-sized fish such as the bigscale pomfret, which live deep during the day and rise at night to feed, linking deep and surface food webs. Using satellite tags, researchers t",
      "fantasy_headline": "Deep Sea Wizards Uncover Secret of the Shadow-Waters!",
      "fantasy_story": "The Ocean Wizards have finally solved a long-standing mystery of the Gloom-depths. Giant sea beasts, like the great sharks, follow the elusive shimmerfish. These twilight creatures link the surface realms to the deepest, darkest trenches, guided by ancient magic.",
      "tag": "nature"
    },
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251228074453.htm",
      "status": "published",
      "reason": null,
      "original_headline": "Most distant supernova: James Webb sees a star explode at cosmic dawn",
      "original_summary": "Scientists have detected the most distant supernova ever seen, exploding when the universe was less than a billion years old. The event was first signaled by a gamma-ray burst and later confirmed using the James Webb Space Telescope, which was able to isolate the blast from its faint host galaxy. Su",
      "fantasy_headline": "Celestial Mages Witness a Star's Grand Bloom at Creation's Dawn!",
      "fantasy_story": "The Celestial Mages, using their Grand Crystal Scryer, have witnessed a star's explosion from the earliest days of creation. This brilliant celestial bloom, first heralded by an aetheric pulse, is the most distant event ever observed. It unveils secrets from when the cosmos first began to form.",
      "tag": "magic"
    },
    {
      "id": "https://www.theverge.com/news/850876/lg-gallery-tv-ces-2026",
      "status": "published",
      "reason": null,
      "original_headline": "LG is announcing its own Frame-style TV at CES",
      "original_summary": "In just the past couple years, the art TV category that's been dominated by Samsung's The Frame has seen growth, with additions from both TCL and Hisense. Now LG has announced its own entry, the LG Gallery TV. The TV will leverage the Gallery+ service that LG released earlier this year, which includ",
      "fantasy_headline": "The LG Merchant Guild Unveils New Magic Portrait Panel!",
      "fantasy_story": "At the Grand Merchant Faire, the esteemed LG Guild unveiled its own Enchanted Portrait Panel. This new scrying screen, much like those from the Samsung and TCL Clans, can display endless wondrous artworks. It uses the Guild's special Gallery Enchantment service to bring static portraits to life.",
      "tag": "merchants"
    },
    {
      "id": "https://www.theverge.com/news/850832/gog-cd-projekt-acquisition-steam",
      "status": "published",
      "reason": null,
      "original_headline": "GOG&#8217;s Steam-alternative PC game store is leaving CD Projekt, staying DRM-free",
      "original_summary": "GOG is splitting from CD Projekt, the game company that launched the preservation-focused PC gaming marketplace in 2008. In an update on Monday, GOG announced that its co-founder, Michał Kiciński, has acquired the digital storefront and its online gaming platform GOG Galaxy from CD Projekt - which h",
      "fantasy_headline": "GOG Gaming Guild Splits from CD Projekt Clan, Keeps Scrolls Unbound!",
      "fantasy_story": "The GOG Gaming Guild has announced its separation from the mighty CD Projekt Clan. Co-founder Michał Kiciński has purchased the Arcane Gaming Emporium and its Grand Scry-Game Nexus. The Guild promises to continue offering unbound scrolls, ensuring players can enjoy their magical games freely.",
      "tag": "merchants"
    }
  ]
}