{
  "last_updated": "2025-12-12 08:29:49",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251211100631.htm",
      "status": "published",
      "reason": "",
      "original_headline": "Scientists find a massive hidden CO2 sponge beneath the ocean floor",
      "original_summary": "Researchers found that eroded lava rubble beneath the South Atlantic can trap enormous amounts of CO2 for tens of millions of years. These porous breccia deposits store far more carbon than previously sampled ocean crust. The discovery reshapes how scientists view the long-term balance of carbon bet",
      "fantasy_headline": "Alchemists Discover Vast Dark Air Trap Beneath the Southern Seas!",
      "fantasy_story": "The Royal Alchemists' Guild has unearthed a secret under the great southern ocean. Beneath ancient volcanic rock, they found porous stone capable of absorbing vast amounts of noxious fumes. This grand discovery could help cleanse the kingdom's air for ages to come.",
      "tag": "nature"
    },
    {
      "id": "https://www.theverge.com/games/843260/tomb-raider-catalyst-trailer-tomb-raider-atlantis",
      "status": "published",
      "reason": "",
      "original_headline": "Tomb Raider announces two new games",
      "original_summary": "While Geoff Keighley had already announced that Tomb Raider would be making a Game Awards appearance, the surprise was that instead of one game announcement there's two. Crystal Dynamics and Amazon Game Studios are releasing two Tomb Raider games back-to-back in 2026 and 2027. First up, coming in 20",
      "fantasy_headline": "Two New Grand Sagas Unveiled from the Sunken Crypts!",
      "fantasy_story": "The Crystal Clan and the River Guild have revealed magnificent news for all adventurers. Instead of just one, two grand new sagas about the famous Explorer Lady Lara will soon be presented. Tales of ancient ruins and forgotten magic are expected in the coming years.",
      "tag": "kingdom"
    },
    {
      "id": "https://www.theverge.com/gadgets/802969/best-gifts-under-50-2025",
      "status": "published",
      "reason": "",
      "original_headline": "The best Christmas gifts we love under $50",
      "original_summary": "One of the easiest things to do during the holidays is spend too much money. It happens to many of us, even when we swear that things are going to be different this year. We want to help you stay true to your intentions to save money when possible, and we're doing that with a […]",
      "fantasy_headline": "Wise Gifts for the Winter Solstice, Under Fifty Gold Coins!",
      "fantasy_story": "As the Winter Solstice Festival approaches, many worry about squandering their precious gold coins. Fear not, for the Royal Merchants' Guild has assembled a list of splendid tokens. These delightful keepsakes cost less than fifty gold coins, helping you celebrate wisely this year.",
      "tag": "merchants"
    }
  ]
}