{
  "last_updated": "2025-12-26 08:28:16",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251225085728.htm",
      "status": "published",
      "reason": "",
      "original_headline": "A Christmas tree 80 light-years wide appears in space",
      "original_summary": "This Christmas, astronomers are highlighting a spectacular region of space that looks remarkably like a glowing holiday tree. Known as NGC 2264, this distant star-forming region sits about 2,700 light-years away and is filled with newborn stars lighting up clouds of gas and dust. The stars form a tr",
      "fantasy_headline": "Celestial 'Yuletide Tree' Shines Bright in the Night Sky!",
      "fantasy_story": "The esteemed Sky-Wizards have observed a wondrous new sight in the celestial tapestry. Far beyond the reach of any griffon, a magnificent formation of newborn celestial lights now glows like a giant Yuletide tree. It fills the distant cosmic mists with sparkling enchantment, a truly magical spectacle for all.",
      "tag": "magic"
    },
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251225080729.htm",
      "status": "published",
      "reason": "",
      "original_headline": "Astronomers discover one of the Universe’s largest spinning structures",
      "original_summary": "Scientists have discovered a giant cosmic filament where galaxies spin in sync with the structure that holds them together. The razor-thin chain of galaxies sits inside a much larger filament that appears to be slowly rotating as a whole. This coordinated motion is far stronger than expected by chan",
      "fantasy_headline": "Wizards Uncover Vast, Twirling Celestial Chain!",
      "fantasy_story": "The wise Star-Sages have unveiled a colossal, swirling wonder within the cosmos! A long, thin chain of shimmering star-islands has been found, dancing in perfect unison with the mystical structure that binds them. This grand celestial ballet is a sight of immense power and mystery, far beyond common understanding.",
      "tag": "magic"
    }
  ]
}