{
  "last_updated": "2026-01-20 01:45:08",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2026/01/260118233609.htm",
      "status": "published",
      "reason": null,
      "original_headline": "Inside the mysterious collapse of dark matter halos",
      "original_summary": "Physicists have unveiled a new way to simulate a mysterious form of dark matter that can collide with itself but not with normal matter. This self-interacting dark matter may trigger a dramatic collapse inside dark matter halos, heating and densifying their cores in surprising ways. Until now, this ",
      "fantasy_headline": "Wizards Discover Unstable Shadow Mists Collapsing Cosmic Veils",
      "fantasy_story": "The Arch-Wizards of the Celestial Tower have gazed into their scrying pools, revealing strange truths about the Ethereal Shadow Mists. These hidden Mists, unable to touch regular matter, can collide with themselves, causing ancient cosmic veils to dramatically unravel. This startling discovery explains why some celestial realms grow unexpectedly dense and hot.",
      "tag": "magic"
    },
    {
      "id": "https://www.theverge.com/news/864229/openai-focus-practical-adoption-sarah-friar",
      "status": "published",
      "reason": null,
      "original_headline": "OpenAI’s 2026 ‘focus’ is ‘practical adoption’",
      "original_summary": "OpenAI plans to focus on \"practical adoption\" of AI in 2026, according to a blog post from CFO Sarah Friar. As the company spends a huge amount of money on infrastructure, OpenAI is working on \"closing the gap\" on what AI can do and how people actually use it. \"The opportunity is large and immediate",
      "fantasy_headline": "Grand Artificers Aim for Everyday Magic Use",
      "fantasy_story": "The Grand Artificers' Guild, led by Master Treasurer Sarah Friar, declared their intent to make their wondrous sentient enchantments accessible to all. The Guild invests vast fortunes into new workshops and mana conduits, striving to bridge the gap between powerful magic and its practical application. Soon, even common folk may wield these amazing artifacts.",
      "tag": "magic"
    }
  ]
}