{
  "last_updated": "2025-12-17 12:43:49",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251216081949.htm",
      "status": "published",
      "reason": null,
      "original_headline": "Ramanujan’s 100-year-old pi formula is still revealing the Universe",
      "original_summary": "Ramanujan’s elegant formulas for calculating pi, developed more than a century ago, have unexpectedly resurfaced at the heart of modern physics. Researchers at IISc discovered that the same mathematical structures behind these formulas also describe real-world phenomena like turbulence, percolation,",
      "fantasy_headline": "Ancient Sage's Pi Rune Still Unlocks Cosmos' Secrets",
      "fantasy_story": "A century-old magical formula, once penned by the wise Sage Ramanujan, is still revealing profound truths about the universe. The Royal Alchemists' Guild found that its elegant patterns perfectly describe powerful currents and hidden flows within our very world. It seems the old magic continues to echo through time.",
      "tag": "magic"
    },
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251216081947.htm",
      "status": "published",
      "reason": null,
      "original_headline": "A simple turn reveals a 1,500-year-old secret on Roman glass",
      "original_summary": "A museum visit sparked a revelation when a Roman glass cup was turned around and its overlooked markings came into focus. These symbols, once dismissed as decoration, appear to be workshop identifiers used by teams of skilled artisans. The findings challenge centuries of assumptions about how Roman ",
      "fantasy_headline": "Ancient Goblet Reveals Master Crafters' Hidden Markings",
      "fantasy_story": "Within the Royal Archives, a simple turn of an ancient Roman glass goblet revealed a long-lost secret. Faint symbols, once thought mere decoration, were uncovered as the unique marks of master crafters' guilds. This discovery changes centuries of belief about these enchanted artifacts.",
      "tag": "kingdom"
    }
  ]
}