{
  "last_updated": "2025-12-30 12:43:32",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251228074505.htm",
      "status": "published",
      "reason": null,
      "original_headline": "The deep ocean has a missing link and scientists finally found it",
      "original_summary": "Scientists have uncovered why big predators like sharks spend so much time in the ocean’s twilight zone. The answer lies with mid-sized fish such as the bigscale pomfret, which live deep during the day and rise at night to feed, linking deep and surface food webs. Using satellite tags, researchers t",
      "fantasy_headline": "Ocean Scholars Unravel Mystery of Deep-Sea Feast Chain!",
      "fantasy_story": "Wise ocean scholars have finally understood why the Great Sea Hounds frequent the murky Gloom Depths. It seems the nimble Shimmer-Fin Swimmers link the deep-sea realms to the sunlit surface by rising at night to feed. Their movements, tracked by enchanted buoys, reveal a vital connection in the Grand Feast Chain.",
      "tag": "nature"
    },
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251228074453.htm",
      "status": "published",
      "reason": null,
      "original_headline": "Most distant supernova: James Webb sees a star explode at cosmic dawn",
      "original_summary": "Scientists have detected the most distant supernova ever seen, exploding when the universe was less than a billion years old. The event was first signaled by a gamma-ray burst and later confirmed using the James Webb Space Telescope, which was able to isolate the blast from its faint host galaxy. Su",
      "fantasy_headline": "Astral Wizards Witness Grand Celestial Firebloom from Cosmic Dawn!",
      "fantasy_story": "Through the mighty Far-Eye Orb, the Astral Wizards have seen a magnificent Celestial Firebloom, the most distant ever recorded! It erupted during the Youngest Times of the cosmos, its bright star-shriek piercing the void. This grand spectacle was confirmed, even isolating its light from a distant star-isle.",
      "tag": "magic"
    },
    {
      "id": "https://www.theverge.com/news/850876/lg-gallery-tv-ces-2026",
      "status": "published",
      "reason": null,
      "original_headline": "LG is announcing its own Frame-style TV at CES",
      "original_summary": "In just the past couple years, the art TV category that's been dominated by Samsung's The Frame has seen growth, with additions from both TCL and Hisense. Now LG has announced its own entry, the LG Gallery TV. The TV will leverage the Gallery+ service that LG released earlier this year, which includ",
      "fantasy_headline": "Grand Bazaar of Enchanted Wares Welcomes New Gallery Scrying Mirror!",
      "fantasy_story": "At the Great Guild Exposition, the renowned artisans of the Loremaster Guild unveiled their new Framed Scrying Mirror. This magical artifact challenges the dominance of other clans in the Realm of Decorative Scrying. It uses the Scroll of Endless Images to display enchanting illusions, bringing beauty to any keep.",
      "tag": "merchants"
    },
    {
      "id": "https://www.theverge.com/news/850832/gog-cd-projekt-acquisition-steam",
      "status": "published",
      "reason": null,
      "original_headline": "GOG&#8217;s Steam-alternative PC game store is leaving CD Projekt, staying DRM-free",
      "original_summary": "GOG is splitting from CD Projekt, the game company that launched the preservation-focused PC gaming marketplace in 2008. In an update on Monday, GOG announced that its cofounder, Michał Kiciński, has acquired the digital storefront and its online gaming platform GOG Galaxy from CD Projekt - which he",
      "fantasy_headline": "Scrollkeepers' Guild Parts Ways with Dragon's Roar Clan!",
      "fantasy_story": "The venerable Scrollkeepers' Guild, known for its archive of Unbound Scrolls, is separating from the mighty Dragon's Roar Clan. Its cofounder, Master Kiciński, has reacquired the Grand Archive of Enchanted Tales and the Nexus of Shared Adventures. The Guild promises to continue offering tales without the burden of magical locks.",
      "tag": "merchants"
    }
  ]
}