{
  "last_updated": "2025-12-12 01:40:48",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251211100631.htm",
      "status": "published",
      "reason": "",
      "original_headline": "Scientists find a massive hidden CO2 sponge beneath the ocean floor",
      "original_summary": "Researchers found that eroded lava rubble beneath the South Atlantic can trap enormous amounts of CO2 for tens of millions of years. These porous breccia deposits store far more carbon than previously sampled ocean crust. The discovery reshapes how scientists view the long-term balance of carbon bet",
      "fantasy_headline": "Wizards Discover Great Deep-Sea Trap for Unhealthy Mists!",
      "fantasy_story": "Beneath the South Atlantic, a new discovery by the Royal Alchemists has unveiled vast volcanic rocks capable of capturing dark, unhealthy mists. These ancient stones, hidden deep within the ocean floor, can store great amounts of these vapors for ages. This finding changes how our wise ones understand the balance of such mists in the world.",
      "tag": "nature"
    },
    {
      "id": "https://www.theverge.com/tech/791574/best-switch-2-controllers",
      "status": "published",
      "reason": "",
      "original_headline": "I’ve tested the latest Switch 2 controllers, and this one is the best",
      "original_summary": "If you choose to get an extra controller for your Nintendo Switch 2, you can spend a lot — and get a lot in return. Buying Nintendo’s own $89.99 Switch 2 Pro Controller, for instance, will net you the console’s only wireless controller with a 3.5mm headphone jack for private listening, not to mentio",
      "fantasy_headline": "Explorer Finds Best Control Gem for the Crystal Scrying Orb!",
      "fantasy_story": "A seasoned explorer of enchanted artifacts has found the finest control gem for the famed Crystal Scrying Orb. While many gems exist, the Enchanter's Guild's own Master Wand offers superior control and a whispering connection. It also includes an ear-charm port for private listening to the Orb's mystic sounds, for a price of 89 gold coins.",
      "tag": "magic"
    }
  ]
}