{
  "last_updated": "2025-12-27 08:26:56",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251226045338.htm",
      "status": "published",
      "reason": null,
      "original_headline": "Something fundamental about black holes may be changing",
      "original_summary": "New observations reveal that the relationship between ultraviolet and X-ray light in quasars has changed over billions of years. This unexpected shift suggests the structure around supermassive black holes may evolve with time, challenging a decades-old assumption.",
      "fantasy_headline": "Ancient Void's Glow Shifts: Wizards Ponder Cosmos' Change!",
      "fantasy_story": "Star-gazing Wizards have noted a strange alteration in the ethereal glows from the Great Abyss. For eons, the mystical relationship between its arcane lights was thought constant. Now, the Sages believe the very fabric around the Void of Oblivion may be shifting, challenging ancient teachings about the cosmos.",
      "tag": "magic"
    },
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251225085728.htm",
      "status": "published",
      "reason": null,
      "original_headline": "A Christmas tree 80 light-years wide appears in space",
      "original_summary": "This Christmas, astronomers are highlighting a spectacular region of space that looks remarkably like a glowing holiday tree. Known as NGC 2264, this distant star-forming region sits about 2,700 light-years away and is filled with newborn stars lighting up clouds of gas and dust. The stars form a tr",
      "fantasy_headline": "A Giant Yule-Tree Sparkles in the Celestial Expanse!",
      "fantasy_story": "The Sky-weavers of the Grand Observatory have unveiled a wondrous sight in the celestial expanse. A vast region, shimmering with newborn stars and mystical dust, now resembles a colossal Yule-tree. This distant spectacle, known as the 'Winter Solstice's Crown,' brings cheer to all who gaze upon the starry realms.",
      "tag": "nature"
    },
    {
      "id": "https://www.theverge.com/news/850398/rodeo-hinge-social-app-friends",
      "status": "published",
      "reason": null,
      "original_headline": "Rodeo is an app for making plans with friends you already have",
      "original_summary": "There are plenty of dating apps out there and apps that turn your chaos of work obligations into easily actionable lists. There is also a growing number of apps that help you make new friends. The pitch for Rodeo is a bit different in that it uses AI to help you schedule activities with your […]",
      "fantasy_headline": "New Enchanted Orb Conjures Merriment for Loyal Companions!",
      "fantasy_story": "A clever new enchanted orb has been revealed to help folk arrange gatherings with their dearest comrades. While many artifacts seek to find new allies, this one uses tiny spirits of insight to whisper ideas for existing fellowships. It ensures no joyous occasion is missed, weaving plans with ease.",
      "tag": "magic"
    }
  ]
}