{
  "last_updated": "2026-01-01 01:52:13",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251228074505.htm",
      "status": "published",
      "reason": null,
      "original_headline": "The deep ocean has a missing link and scientists finally found it",
      "original_summary": "Scientists have uncovered why big predators like sharks spend so much time in the ocean’s twilight zone. The answer lies with mid-sized fish such as the bigscale pomfret, which live deep during the day and rise at night to feed, linking deep and surface food webs. Using satellite tags, researchers t",
      "fantasy_headline": "Wizards Discover Abyssal Secret: The Missing Link of the Deep!",
      "fantasy_story": "Wise Alchemists of the Deep Sea Guild have uncovered a great mystery in the Abyssal Depths. They found small, shimmer-scaled dwellers connect the surface's bounty to the deep's mighty sea beasts. These magical fish rise at night to feed, completing the ocean's mystical chain of sustenance.",
      "tag": "nature"
    },
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251228074458.htm",
      "status": "published",
      "reason": null,
      "original_headline": "Time runs faster on Mars and scientists just proved it",
      "original_summary": "Thanks to Einstein’s relativity, time flows differently on Mars than on Earth. NIST scientists have now nailed down the difference, showing that Mars clocks tick slightly faster—and fluctuate over the Martian year. These microsecond shifts could play a big role in future Mars navigation, communicati",
      "fantasy_headline": "Celestial Wizards Confirm: Time Flees Faster on The Red Orb!",
      "fantasy_story": "The esteemed Celestial Wizards' Guild has confirmed a fascinating truth about The Red Orb. Due to the Grand Weave of Time, moments pass quicker there than in our Azure Realm. These subtle flicks of the sands could greatly aid future astrological charting and sending spells to the distant world.",
      "tag": "magic"
    }
  ]
}