{
  "last_updated": "2025-12-25 12:41:07",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251225031247.htm",
      "status": "published",
      "reason": null,
      "original_headline": "Scientists found a way to restore brain blood flow in dementia",
      "original_summary": "A new study suggests that dementia may be driven in part by faulty blood flow in the brain. Researchers found that losing a key lipid causes blood vessels to become overactive, disrupting circulation and starving brain tissue. When the missing molecule was restored, normal blood flow returned. This ",
      "fantasy_headline": "Alchemists Discover Cure for Ailing Minds",
      "fantasy_story": "The Alchemists' Guild has unveiled a wondrous new potion! They discovered that failing thoughts are caused by vital humours not flowing correctly in the skull. By restoring a missing precious essence, the normal flow of life-essence returns, mending the mind.",
      "tag": "magic"
    },
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251224032404.htm",
      "status": "published",
      "reason": null,
      "original_headline": "What are asteroids really made of? New analysis brings space mining closer to reality",
      "original_summary": "Scientists are digging into the hidden makeup of carbon-rich asteroids to see whether they could one day fuel space exploration—or even be mined for valuable resources. By analyzing rare meteorites that naturally fall to Earth, researchers have uncovered clues about the chemistry, history, and poten",
      "fantasy_headline": "Wizards Study Sky-Stones for Celestial Treasures",
      "fantasy_story": "The Royal Wizards are investigating the hidden makeup of dark, drifting sky-stones. They hope these celestial rocks could one day fuel grand journeys beyond the clouds or be harvested for precious ores. By analyzing fallen sky-fragments, they uncover clues about these magical elements.",
      "tag": "magic"
    },
    {
      "id": "https://www.theverge.com/gadgets/849637/anker-laptop-power-bank-xbox-series-x-deal-sale",
      "status": "published",
      "reason": null,
      "original_headline": "Anker’s beefy Laptop Power Bank has returned to its Black Friday low",
      "original_summary": "As you might expect, things have been relatively quiet on the deals front since Black Friday, particularly when it comes to discounts on charging accessories. Thankfully, Anker’s aptly titled Laptop Power Bank is once again on sale at Amazon and Walmart for $87.99 ($47 off), which matches the record",
      "fantasy_headline": "Anker Clan's Portable Energy Crystal Returns to Sale",
      "fantasy_story": "The Anker Clan's popular portable energy crystal is once again offered at a grand bargain! Since the Great Market Day, discounts have been rare on charging artifacts. Now, the crystal can be found in the Grand Marketplaces for only 87 gold coins and 99 copper pennies, a truly excellent deal.",
      "tag": "merchants"
    },
    {
      "id": "https://www.theverge.com/gadgets/684281/sony-playstation-5-ps5-pro-christmas-deal-sale-2025",
      "status": "published",
      "reason": null,
      "original_headline": "Sony’s souped-up PlayStation 5 Pro is $100 off for the rest of today",
      "original_summary": "Sony’s full suite of PlayStation 5 consoles jumped in price in August due to increased US tariffs, but now through Christmas, you can save $100 on several models. This discount is especially great if you planned to go big with Sony’s PS5 Pro, the company’s priciest, most powerful console yet. Normal",
      "fantasy_headline": "House of Sony Offers Yuletide Discount on Grand Scrying Orb",
      "fantasy_story": "The House of Sony announces a special Yuletide saving on their grandest enchanted scrying orbs! After new taxes from the Western Kingdoms raised prices, you can now save 100 gold coins. This is a rare chance to acquire their most powerful orb of amusement.",
      "tag": "merchants"
    }
  ]
}