{
  "last_updated": "2025-12-09 12:43:10",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251208052804.htm",
      "status": "published",
      "reason": null,
      "original_headline": "Single enzyme mutation reveals a hidden trigger in dementia",
      "original_summary": "Researchers discovered that a tiny structural feature of the enzyme GPX4 helps keep neurons safe. A rare mutation removes this protection, allowing harmful molecules to damage cell membranes and trigger early dementia. Mouse and cell studies showed changes resembling Alzheimer’s. Early tests to slow",
      "fantasy_headline": "Alchemists Uncover Secret of Mind-Fog Sickness",
      "fantasy_story": "The Grand Alchemists' Guild has unearthed a vital secret: a tiny imperfection in a magical protective charm can lead to the dreaded mind-fog sickness. This flaw allows dark wisps to cloud the spirit-cores, causing memories to fade. Wizards are now testing new potions to mend this charm and restore clear thought.",
      "tag": "magic"
    },
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251208052535.htm",
      "status": "published",
      "reason": null,
      "original_headline": "A cosmic collision reveals how black holes really behave",
      "original_summary": "A remarkably clean gravitational-wave detection has confirmed long-standing predictions about black holes, including Hawking’s area theorem and Einstein’s ringdown behavior. The findings also provide the strongest support yet that real black holes follow the Kerr model.",
      "fantasy_headline": "Cosmic Sages Confirm Ancient Lore of the Void-Maws",
      "fantasy_story": "From a grand dance of celestial bodies, the Cosmic Sages have detected profound whispers from the void. These vibrations from the deep cosmos confirm ancient prophecies about the great void-maws, proving their mysterious ways align with long-held sagely wisdom. The findings bolster beliefs that these cosmic abysses follow the Kerr model.",
      "tag": "magic"
    }
  ]
}