{
  "last_updated": "2025-12-22 08:30:37",
  "stories": [
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251221091246.htm",
      "status": "published",
      "reason": "",
      "original_headline": "Study links full-fat cheese to lower dementia risk",
      "original_summary": "Eating full-fat cheese and cream may be associated with a lower risk of dementia, according to a large study that tracked people for more than 25 years. Those who consumed higher amounts of these foods developed dementia less often than those who ate little or none. Interestingly, low-fat dairy prod",
      "fantasy_headline": "New Discovery: Rich Cheese May Ward Off Fading Mind!",
      "fantasy_story": "The Royal Wizards of the Culinary Arts have unveiled a surprising discovery! After observing many villagers for over two decades, their latest scrolls suggest that feasting upon rich, full-fat cheeses and creams might protect against the dreaded Clouding Sickness, a malady of the mind.",
      "tag": "magic"
    },
    {
      "id": "https://www.sciencedaily.com/releases/2025/12/251221091237.htm",
      "status": "published",
      "reason": "",
      "original_headline": "This AI finds simple rules where humans see only chaos",
      "original_summary": "A new AI developed at Duke University can uncover simple, readable rules behind extremely complex systems. It studies how systems evolve over time and reduces thousands of variables into compact equations that still capture real behavior. The method works across physics, engineering, climate science",
      "fantasy_headline": "Mystic Oracle Reveals Hidden Truths in Chaotic Spells!",
      "fantasy_story": "Wizards at the Grand Academy of Duke have crafted a marvelous new enchanted automaton! This mystic oracle can discern simple, hidden patterns within even the most chaotic enchantments and tangled realities. It reduces countless magical threads into elegant runes, revealing the true nature of the cosmos, crafted artifacts, and changing seasons.",
      "tag": "magic"
    },
    {
      "id": "https://www.theverge.com/24343913/paypal-honey-megalag-coupon-scam-affiliate-fees",
      "status": "published",
      "reason": "",
      "original_headline": "Honey: all the news about PayPal’s alleged scam coupon app",
      "original_summary": "PayPal’s Honey browser extension has been lauded for years as an easy way to find coupons online. But some are calling it a “scam” after a deep dive from YouTuber MegaLag, who accused Honey of “stealing money from influencers,” and returned one year later with a second video that says Honey targeted",
      "fantasy_headline": "Honey Charm Accused of Deceiving Bards of the Etherweaves!",
      "fantasy_story": "The Honey Charm, a popular enchanted scroll offered by the Grand Merchant's Guild of Pay'Pal, has long been praised for finding bargain scrolls. However, the wandering bard MegaLag now claims it practices trickery, unjustly claiming gold from famed storytellers of the Etherweaves. Many now question the charm's true intentions.",
      "tag": "merchants"
    },
    {
      "id": "https://www.theverge.com/news/848843/waymo-san-francisco-power-outage",
      "status": "published",
      "reason": "",
      "original_headline": "Frozen Waymos backed up San Francisco traffic during a widespread power outage",
      "original_summary": "A power outage struck San Francisco on Saturday that blacked out about 130,000 customers at its peak, according to Pacific Gas and Electric Company, but also caused another problem: stranded Waymo vehicles. Posts all over social media showed the company's autonomous SUVs sitting still in the streets",
      "fantasy_headline": "Arcane Darkness Strands Waymo Golems in Sanctus Francisco!",
      "fantasy_story": "A sudden arcane darkness swept over the Great City of Sanctus Francisco, leaving countless households in gloom. This magical blight also brought Waymo's enchanted carriages to a halt! Many folk shared crystal orb visions of the driverless chariots sitting motionless in the streets, causing great confusion in the city's thoroughfares.",
      "tag": "magic"
    }
  ]
}